# Import libraries and dataset

In [1412]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
plt.rcParams['figure.dpi'] = 150
import scipy.stats as stats
import numpy as np
from sklearn.preprocessing import MinMaxScaler, StandardScaler

In [1413]:
df = pd.read_csv(r"C:\Users\Cris\Documents\Repos\TitanicML\titanic_train.csv")

# Train Test Split

Since the data is already split for us, there is no need to use a data-splitting function from a library (or even do it ourselves manually, hehe). Instead, we're going to create a partition of our *df* dataset as training data, and load the test dataset to have them both ready for our Machine Learning Model.

In [1467]:
x_train = data_pipeline(df.drop(columns=["Survived"]))
y_train = df.Survived
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sex          891 non-null    uint8
 1   Age          891 non-null    float64
 2   SibSp        891 non-null    int64
 3   Parch        891 non-null    int64
 4   Fare         891 non-null    float64
 5   Class1       891 non-null    uint8
 6   Class2       891 non-null    uint8
 7   Class3       891 non-null    uint8
 8   Cherbourg    891 non-null    uint8
 9   Queenstown   891 non-null    uint8
 10  Southampton  891 non-null    uint8
 11  Alone        891 non-null    int32
dtypes: float64(2), int32(1), int64(2), uint8(7)
memory usage: 37.5 KB

C:\Users\Cris\AppData\Local\Temp\ipykernel_11772\3334697274.py:10: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  data.Age.fillna(pd.Series(age_sample.to_list(), index=data.Age[data.Age.isna()].index), inplace=True)
C:\Users\Cris\AppData\Local\Temp\ipykernel_11772\3334697274.py:12: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  data.Fare.fillna(pd.Series(fare_sample.to_list(), index=data.Fare[data.Fare.isna()].index), inplace=True)

In [1468]:
from sklearn.model_selection import train_test_split

x_train, x_validate, y_train, y_validate = train_test_split(x_train, y_train, train_size=0.8)

In [1469]:
test = pd.read_csv("titanic_test.csv")
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [1470]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [1471]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

We pass this data frame through our data pipeline so we have homogeneous datasets

In [1472]:
test_id = test.PassengerId
# test.fillna(test.Fare.mean(), inplace=True)

In [1473]:
test = data_pipeline(test)
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sex          418 non-null    uint8
 1   Age          418 non-null    float64
 2   SibSp        418 non-null    int64
 3   Parch        418 non-null    int64
 4   Fare         418 non-null    float64
 5   Class1       418 non-null    uint8
 6   Class2       418 non-null    uint8
 7   Class3       418 non-null    uint8
 8   Cherbourg    418 non-null    uint8
 9   Queenstown   418 non-null    uint8
 10  Southampton  418 non-null    uint8
 11  Alone        418 non-null    int32
dtypes: float64(2), int32(1), int64(2), uint8(7)
memory usage: 17.7 KB

In [1474]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sex          418 non-null    uint8
 1   Age          418 non-null    float64
 2   SibSp        418 non-null    int64
 3   Parch        418 non-null    int64
 4   Fare         418 non-null    float64
 5   Class1       418 non-null    uint8
 6   Class2       418 non-null    uint8
 7   Class3       418 non-null    uint8
 8   Cherbourg    418 non-null    uint8
 9   Queenstown   418 non-null    uint8
 10  Southampton  418 non-null    uint8
 11  Alone        418 non-null    int32
dtypes: float64(2), int32(1), int64(2), uint8(7)
memory usage: 17.7 KB

In [1475]:
test.head()

,Sex,Age,SibSp,Parch,Fare,Class1,Class2,Class3,Cherbourg,Queenstown,Southampton,Alone
0,0,0.451711,0,0,0.015282,0,0,1,0,1,0,1
1,1,0.616184,1,0,0.013663,0,0,1,0,0,1,0
2,0,0.813553,0,0,0.018909,0,1,0,0,1,0,1
3,0,0.353026,0,0,0.016908,0,0,1,0,0,1,1
4,1,0.287237,1,1,0.023984,0,0,1,0,0,1,0

# Machine Learning Model

In [1476]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.neural_network import MLPClassifier
from numpy import random

In [1477]:
# rs = random.randint(0, 999)
rs = 0
# model = RandomForestClassifier(random_state=rs)
# model = GradientBoostingClassifier(random_state=rs)
model = MLPClassifier(
    random_state=0, 
    solver="adam",
    activation="relu",
    hidden_layer_sizes=(16,),
    learning_rate="adaptive",
    learning_rate_init=0.01,
    max_iter=5000)
model.fit(x_train, y_train)

MLPClassifier(hidden_layer_sizes=(16,), learning_rate='adaptive',
              learning_rate_init=0.01, max_iter=5000, random_state=0)

In [1478]:
# model = MLPClassifier(random_state=rs,  solver="adam", activation="relu", hidden_layer_sizes=(16,64,128,), learning_rate="adaptive", learning_rate_init=0.1, max_iter=5000)